blog/app/controllers/articles_controller.rb

	def create
		#render plain: params[:article].inspect
		#@article = Article.new(params[:article])
		#@article = Article.new(params.require(:article).permit(:title, :text))
		 @article = Article.new(article_params)

  if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ssd"], ["text", "jl"], ["created_at", "2016-02-22 01:04:25.684033"], ["updated_at", "2016-02-22 01:04:25.684033"]]