app/controllers/clubs_controller.rb

SELECT users.*, memberships.approved, memberships.id as memberships_id FROM "users" INNER JOIN "memberships" ON "memberships"."user_id" = "users"."id" WHERE "memberships"."club_id" = ?  [["club_id", 1]]
---
  def show
    @club_members = User.joins(:memberships).where(:memberships => {club_id: @club.id})

SELECT "clubs".* FROM "clubs" WHERE (description LIKE '%test%')  ORDER BY name ASC
---
  def join
    @clubs = Club.all

INSERT INTO "clubs" ("name", "description", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Club1"], ["description", "test1"], ["admin_id", 1], ["created_at", "2016-04-22 00:18:12.734707"], ["updated_at", "2016-04-22 00:18:12.734707"]]
INSERT INTO "memberships" ("user_id", "club_id", "approved", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["club_id", 6], ["approved", "t"], ["created_at", "2016-04-23 23:02:51.641467"], ["updated_at", "2016-04-23 23:02:51.641467"]]
---
  def create
    @club = current_user.clubs_as_admin.build(club_params) #Club.new(club_params)

    respond_to do |format|
      if @club.save
        @club_membership = Membership.new(user_id: current_user.id, club_id: @club.id, approved: true)
        if @club_membership.save

UPDATE "clubs" SET "description" = ?, "updated_at" = ? WHERE "clubs"."id" = ?  [["description", "SWAG SHIT"], ["updated_at", "2016-04-26 02:49:22.674345"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @club.update(club_params)

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", 7]]
---
    def set_club
      @club = Club.find(params[:id])