app/controllers/clubs_controller.rb

  def join
    @clubs = Club.all
    @user_clubs = Membership.where(user_id: current_user.id)
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ?  [["user_id", 1]]