app/controllers/home_controller.rb

  def home
  	@user_memberships = Club.joins(memberships: :user).where(users: {id: current_user.id})
---
SELECT clubs.*, memberships.approved FROM "clubs" INNER JOIN "memberships" ON "memberships"."club_id" = "clubs"."id" INNER JOIN "users" ON "users"."id" = "memberships"."user_id" WHERE "users"."id" = 5