app/controllers/members_controller.rb

INSERT INTO "members" ("club_id", "user_id", "approved", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["club_id", 1], ["user_id", 1], ["approved", "t"], ["created_at", "2016-04-22 05:07:42.590623"], ["updated_at", "2016-04-22 05:07:42.590623"]]
---
  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save