app/controllers/memberships_controller.rb

SELECT "memberships".* FROM "memberships"
---
  def index
    @memberships = Membership.all

INSERT INTO "memberships" ("club_id", "user_id", "approved", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["club_id", 1], ["user_id", 1], ["approved", "f"], ["created_at", "2016-04-22 05:32:57.199443"], ["updated_at", "2016-04-22 05:32:57.199443"]]
---
  def create
    @membership = Membership.new(membership_params)

    respond_to do |format|
      if @membership.save

UPDATE "memberships" SET "user_id" = ?, "id" = ?, "updated_at" = ? WHERE "memberships"."id" = ?  [["user_id", 2], ["id", 2], ["updated_at", "2016-04-26 06:53:21.333778"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @membership.update(membership_params)

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."club_id" = ? AND "memberships"."user_id" = ?  ORDER BY "memberships"."id" ASC LIMIT 1  [["club_id", 1], ["user_id", 5]]
UPDATE "memberships" SET "approved" = ?, "updated_at" = ? WHERE "memberships"."id" = ?  [["approved", "t"], ["updated_at", "2016-04-26 07:25:51.854481"], ["id", 11]]
---
  def update_status
    @membership = Membership.where(club_id: params[:membership][:club_id], user_id: params[:membership][:user_id]).first
    respond_to do |format|
      if @membership.update_attribute(:approved, params[:membership][:approved])

DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 1]]
---
  def destroy
    @membership.destroy