app/controllers/users_controller.rb

SELECT "clubs".* FROM "clubs" INNER JOIN "memberships" ON "memberships"."club_id" = "clubs"."id" INNER JOIN "users" ON "users"."id" = "memberships"."user_id" WHERE "users"."id" = 1
---
	def my_portfolio
		@user_memberships = Club.joins(memberships: :user).where(users: {id: current_user.id})